package days03;

/**
 * @author C_Seung_H0
 * @date 2025. 2. 5. - 오전 11:24:31
 * @subject  	2진수표현, 부동소수점(floating-point) 표현방식 
 * @content		자료형 구조
 * 
 */
public class Ex04 {

	public static void main(String[] args) {
//		0.000011111
//		1.1111 x 2^-5
//		
//		9.12346 실수 -> 2진수 실수 변환 ->	 float(4)/double(8)
//			00011111100110101101101111100110101101101111001101011011011110011010110110111100110101101101...
//		부동소수점
//				가수(M)
//			1.00011111100110101101101111100110101101101111001101011011011110011010110110111100110101101101...
//			x2^3(지수 E)		값이 20번째라고 정하면 뒤에 있는 값들은 소멸.
							
//		
//		
//		int		(4)		10	(정수저장)
		
		
//		float	(4)		10	(실수 저장, 정밀도 낮음)
//			[		8	 E					][	23	M	]
//		[][][][][][][][]	[][][][][][][][]	[][][][][][][][]	[][][][][1][0][1][0]
//		
		
		
//		double(8)	(실수저장, 정밀도 높음)
//			[11 E					][	52	M	]
//				[][][][][][][][]	[][][][][][][][]	[][][][][][][][]	[][][][][][][][][][][][][][][][]	[][][][][][][][]	[][][][][][][][]	[][][][][][][][]
//		
//		BigDecimal class
//		
		char c = '\u0041'; 	//'\n'; 유니코드	'A';	A라는 코드를 담으면 2바이트
		System.out.printf("%C",c);
		
		/*
		 *		10
		 *
		 * 									//16진수값 2진수로 바꾸기 복습.
		 *		00		001		010	
		 *		0		  1		  2
		 * 
		 * 
		 * 
		 * /
		 */
		
		

	}//main

}//class
