
package days02;

/**
 * @author C_Seung_H0
 * @date 2025. 2. 4. - 오후 4:22:56
 * @subject 진법변환 
 * @content byte와 2의 보수 개념 설명
 */
public class Ex05_07 {

	public static void main(String[] args) {
	/*
	 * [진법변환]
	 * 10진법 : 0 1 2 3 4 5 6 7 8 9
	 * 	2진법 : 0 1 
	 * 
	 * 10 -> byte i = 10;
	 * 			[0][0][0][0][1][0][1][0]
	 * 
	 * short s = 10;
	 * 	[음수 표현 방법]
	 * 1. 	부호와절대치
	 * 2. 	1의 보수법
	 * 3. 	(현재) 2의 보수법
	 */
	byte b = -10;
	System.out.printf("%d\n",b);
	//	|-10|
	//	  10
	//	0000 1010
	//부호비트 [1][0][0][0][1][0][1][0] 

	//부호비트 [1][0][0][0][0][0][0][0] -0	
	//부호비트 [1][0][0][0][0][0][0][0] +0
	
	// |-10|
	//	 10
	// 0010 1010		
	// 1111 0101 
	// +	   1
	
	
	//[문제] 어떤 음수가 2의 보수법 저장 : 1010 1010
	//			음수 얼마일까요?
	// 절댓값을 찾으려면 역순으로 계산
	//
	
			
			
	}

}
