package days02;

/**
 * @author C_Seung_H0
 * @date 2025. 2. 4. - 오후 5:29:53
 * @subject		2진수 2진법표현
 * @content
 * 
 */
	public class Ex05_09 {
	
	

		public static void main(String[] args) {
//		 [실수 표현]
//			1) 실수 3.14 -> 2진수 표현 -> float [][][][][][][][] //실수가 double 이여도 오류가 생김
//		 [예]
//								-> 2진수 표현 (2진수 변환)
//		  0.625	->	0.101(2)
//		  0.625 x 2 = [1].25 ↓
//		  0.25	 x 2 = [0].5
//		  0.5	 x 2 = [1].0
//		  
//		  0.1		 0			1(2) 	-> 		10진수 실수 변환
//		  2^-1+  	2^-2		+2^3
//		  
//		  [예] 9.12346 실수 -> 2진수 실수 변환 -> float(4)/double(8)
//		  
//		 
//		
//		
		
		
		

	}//main

}//class
